//==========  формирование текущего описания контура  ==========
//------------ входные данные ---------
//  N - количество точек в исходном описании контура (P:N=P:1);  N1=N-1 
// Np, Sp - номер точки и и смещение от нее для получения местоположения начальной
//                точки и формирования текущего описания  контура
// Xpr[],Ypr[],Spr[] - исходное описание контура
// Sr_pr - длина контура
//------------ выходные данные ---------
// Xd[],Yd[],Sd[] - формируемое текущее описание  контура
// n -  количество точек в формируемом текущем описании контура
//---------------------------------------------------------------------------
#pragma warn -pck
#pragma option -a1
//---------------------------------------------------------------------------
extern double Sr_pr;
extern double Xpr[],Ypr[],Spr[],Xd[],Yd[],Sd[];
int CurrentDecribeObject(int N1,int Np, double Sp)
  {
  int i,j,n,i1,i2;
  double sg,Sfr,st;

  if(Spr[Np-1]<Sp) return(-1);
  i=Np;
  i2=i%N1; i1=(i-1)%N1;
  sg=Sp/Spr[i1];
  Xd[0]=Xpr[i1]*(1.-sg)+Xpr[i2]*sg;
  Yd[0]=Ypr[i1]*(1.-sg)+Ypr[i2]*sg;
  Sfr=Spr[i1]-Sp;
  st=Sfr;
  n=1;
  for(;;)
    { i2=i%N1; i1=(i-1)%N1;
    if(Sfr>=Sr_pr)
      {
      sg=Sfr-Sr_pr;
      Sd[n-1]=st-sg;
      sg/=st;
      Xd[n]=Xpr[i1]*sg+Xpr[i2]*(1.-sg);
      Yd[n]=Ypr[i1]*sg+Ypr[i2]*(1.-sg);
      n++;
      break;
      }

    Xd[n]=Xpr[i2]; Yd[n]=Ypr[i2]; Sd[n-1]=st;
    st=Spr[i2]; Sfr+=st;
    i++; n++;
    }

  return(n);
  }
